Repository: killbillsbor/wordpress-jquery-async-loader
Catalog: trunk/i18n/languages/jquery-async-loader-*.po
Languages: ru_ru

source: You cannot clone instances of %s.
ru_ru: Вы не можете клонировать экземпляры %s.

source: You cannot unserialize instances of %s.
ru_ru: Вы не можете десериализировать экземпляры %s.

source: Settings
ru_ru: Настройки

source: Author
ru_ru: Автор

source: %1$jQuery Async Loader plugin is inactive.%2$s This plugin requires Wordpress 4.1 or newer. Please %3$supdate Wordpress to version 4.1 or newer%4$s
ru_ru: %1$Плагин jQuery Async Loader неактивен.%2$s Этот плагин требует Wordpress 4.1 или новее. Пожалуйста, %3$sобновите Wordpress до версии 4.1 или новее%4$s

source: jQuery Async Loader Settings
ru_ru: Настройка jQuery Async Loader

source: jQuery & Plugins Async Loader Settings
ru_ru: Настройки плагина jQuery & Plugins Async Loader

source: Description and recommendations
ru_ru: Описание и рекомендации

source: Loading of JavaScript resources should be done asynchronously, in a non-blocking manner, so the load time of your webpage will not be affected. But using of deferring or async loading of jQuery causes lots of problems with jQuery plugins. This plugin replaces default Wordpress's JS loader with a special jQuery loader (jQl), that's why there are no any errors with jQuery plugins.
ru_ru: Загрузка JavaScript файлов должна осуществляться асинхронно, то есть неблокирующим способом, так как это не замедляет загрузку страницы. Но использование отложенной или асинхронной загрузки jQuery вызывает множество проблем с jQuery плагинами. Данный плагин заменяет стандартный загрузчик JS скриптов на специальный jQuery загрузчик (jQl), поэтому никаких проблем с плагинами возникать не будет.

source: %1$sIt's highly recommended to use any concatenate plugin,%2$s e.g., %3$s or %4$s. Please, do not add jQuery to the ignore list, because this plugin fixes %5$sundefined jQuery%6$s errors on the console log. Also, it is allowed to use defer or async parsing of JS files.
ru_ru: %1$sКрайне рекомендуется использовать любой плагин для минификации и объединения JavaScript файлов,%2$s например, %3$s или %4$s. Пожалуйста, не добавляйте jQuery в список исключений, так как данный плагин решает проблемы с ошибками %5$sundefined jQuery%6$s в консоли разработчика. Также допускается использование отложенной (defer) и асинхронной (async) загрузки JS файлов.

source: Replace jQuery library with&nbsp;minified CDN version (recommended)
ru_ru: Заменить jQuery на&nbsp;сжатую CDN версию (рекомендуется)

source: Replace
ru_ru: Заменить

source: Use it on the&nbsp;Back-end (admin&nbsp;pages)
ru_ru: Применять в&nbsp;панели администратора

source: Enable
ru_ru: Применять

source: It might be useful sometimes, but it's recommended to disable this option.
ru_ru: Иногда это бывает полезно, но всё же рекомендуется отключить данную опцию.

source: Save Options
ru_ru: Сохранить настройки

source: For advanced users: If you're seeing any scripts loaded using %1$s<script>%2$s tag in your page source code (excluding Google Analytics, FB pixel, etc), please make sure that all the scripts are included correctly through %1$swp_enqueue_script%2$s or similar functions.
ru_ru: Для продвинутых пользователей: Если вы видите какие-либо скрипты, загруженные при помощи традиционного %1$s<script>%2$s тега в исходном коде вашей страницы (за исключением Яндекс.Метрики, Google Analytics, и т.п.), пожалуйста, убедитесь, что все скрипты загружаются корректно при помощи функции %1$swp_enqueue_script%2$s или аналогичных.

source: Special thanks to %1$s, who is the author of jQl.
ru_ru: Особая благодарность %1$s, автору jQl.
