Repository: killbillsbor/wordpress-jquery-async-loader
Catalog: trunk/i18n/languages/woocommerce-featured-then-random-sorting-*.po
Languages: ru_ru

source: You cannot clone instances of %s.
ru_ru: Вы не можете клонировать экземпляры %s.

source: You cannot unserialize instances of %s.
ru_ru: Вы не можете десериализировать экземпляры %s.

source: Settings
ru_ru: Настройки

source: Author
ru_ru: Автор

source: %1$sWooCommerce Featured first then Random plugin is inactive.%2$s This plugin requires WooCommerce 2.3 or newer. Please %3$supdate WooCommerce to version 2.3 or newer%4$s
ru_ru: %1$sWooCommerce Featured first then Random плагин не был активирован.%2$s Плагин требует WooCommerce 2.3 или новее. Пожалуйста, %3$sобновите WooCommerce до версии 2.3 или выше%4$s

source: Custom Default Sorting Label
ru_ru: Название сортировки по умолчанию

source: You can change Default sorting label to any other, for&nbsp;example, &quot;Our Sorting&quot; (or&nbsp;leave blank)
ru_ru: Вы&nbsp;можете изменить название сортировки по&nbsp;умолчанию, например, на&nbsp;&ldquo;Наша сортировка&rdquo; (или оставьте поле пустым)

source: Custom Featured First then Random Sorting Label
ru_ru: Название сортировки "Сначала рекомендуемые, затем случайно"

source: You can change Featured First then Random Sorting label to any other, for&nbsp;example, &quot;Best Sorting Ever&quot;
ru_ru: Вы&nbsp;можете изменить название сортировки &ldquo;Сначала рекомендуемые, затем случайно&rdquo; на&nbsp;любую другую, например, &ldquo;Лучшая сортировка в&nbsp;мире!&rdquo;

source: Randomize...
ru_ru: Перемешивать товары...

source: On the first archive page (default)
ru_ru: На первой странице каталога (по умолчанию)

source: Every day
ru_ru: Каждый день

source: Every hour
ru_ru: Каждый час

source: Choose an&nbsp;event when order should be&nbsp;randomized. Timer starts when user opens your catalog
ru_ru: Выберите событие, при котором товары должны перемешиваться. Отсчёт времени начинается с&nbsp;момента, когда пользователь открывает каталог

source: Default sorting
ru_ru: Сортировка по умолчанию

source: Show featured items first then random
ru_ru: Показывать сначала рекомендуемые, затем случайные товары
